{
  "x": [
    "\"Sydney - Istanbul\"",
    "\"Cairo + Johannesburg\"",
    "\"Sao Paulo - Tokyo\"",
    "\"London - Beijing\"",
    "\"Buenos Aires - New York\"",
    "\"Rome - Mexico City\"",
    "\"Mexico City - Johannesburg\"",
    "\"Tokyo + Seoul\"",
    "\"Lagos + Lagos\"",
    "\"London + Istanbul\""
  ],
  "y": [
    "122",
    "59",
    "-187",
    "-116",
    "16",
    "111",
    "-127",
    "267",
    "6",
    "29"
  ],
  "z": [
    "Using the longitudes of cities, the equation \"Sydney - Istanbul\" translates as \"Sydney\" = 151, \"Istanbul\" = 29. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Cairo + Johannesburg\" translates as \"Cairo\" = 31, \"Johannesburg\" = 28. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sao Paulo - Tokyo\" translates as \"Sao Paulo\" = -47, \"Tokyo\" = 140. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"London - Beijing\" translates as \"London\" = 0, \"Beijing\" = 116. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Buenos Aires - New York\" translates as \"Buenos Aires\" = -58, \"New York\" = -74. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Rome - Mexico City\" translates as \"Rome\" = 12, \"Mexico City\" = -99. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Mexico City - Johannesburg\" translates as \"Mexico City\" = -99, \"Johannesburg\" = 28. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Tokyo + Seoul\" translates as \"Tokyo\" = 140, \"Seoul\" = 127. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Lagos + Lagos\" translates as \"Lagos\" = 3, \"Lagos\" = 3. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"London + Istanbul\" translates as \"London\" = 0, \"Istanbul\" = 29. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result."
  ],
  "z_uninformative": [
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface.",
    "Let's consider the geographic coordinates that specify their east-west or north-south positions on the Earth's surface."
  ],
  "z_demographics": [
    "Sydney has a population of around 5.3 million people, with a breakdown of 58% White, 34.2% Asian, and 2.6% Aboriginal/Torres Strait Islander. The remaining percentages include others. The median age is 36 years. Istanbul is home to approximately 15.5 million people, predominantly of Turkish ethnicity, with various ethnic minorities also present. The median age is 32 years.",
    "Greater Cairo has an estimated population of 20 million, predominantly Arab, with a median age of 24 years. The greater metropolitan area of Johannesburg houses around 5.7 million people, with a diverse population including Black, White, Coloured, and Asian individuals. The median age is 27 years.",
    "The greater metropolitan area of Sao Paulo is home to approximately 21.7 million people, with a diverse population that includes individuals identifying as White, Pardo (mixed), Black, and Asian. The median age is 36 years. The 23 special wards of Tokyo have a combined population of around 14 million, predominantly of Japanese ethnicity. The median age in Tokyo is 45.5 years.",
    "London is home to approximately 9 million residents, with 59.8% being White, 18.5% Asian, 13.3% Black, 5% Mixed, and 3.4% identifying as Other. The median age in the city is 36.5 years. Beijing houses approximately 21.5 million people, primarily of Han Chinese ethnicity. The median age in the city is 37.4 years.",
    "Buenos Aires has a population of approximately 15 million in its greater metropolitan area. The majority of residents are of European descent, with some Mestizos, and the median age is 31 years. With a population of approximately 8.4 million people, New York is diverse. Around 32.1% identify as White, 29.1% as Hispanic, 24.3% as Black, 14.1% as Asian, with the rest being a mixture of Native American, Pacific Islander, and other ethnicities. The median age is 36 years.",
    "Rome has around 2.8 million residents, predominantly White (Italian), and various immigrant groups. The median age is 45 years. The greater metropolitan area of Mexico City has a population of around 21.6 million, predominantly Mestizo, with some Indigenous and White populations. The median age is 31 years.",
    "The greater metropolitan area of Mexico City has a population of around 21.6 million, predominantly Mestizo, with some Indigenous and White populations. The median age is 31 years. The greater metropolitan area of Johannesburg houses around 5.7 million people, with a diverse population including Black, White, Coloured, and Asian individuals. The median age is 27 years.",
    "The 23 special wards of Tokyo have a combined population of around 14 million, predominantly of Japanese ethnicity. The median age in Tokyo is 45.5 years. Seoul has a population of around 9.7 million, predominantly Korean, with a median age of 41 years.",
    "Lagos has a population of approximately 14.8 million in its greater metropolitan area, primarily consisting of Yoruba, Igbo, and other Nigerian ethnic groups. The median age is 18 years. Lagos has a population of approximately 14.8 million in its greater metropolitan area, primarily consisting of Yoruba, Igbo, and other Nigerian ethnic groups. The median age is 18 years.",
    "London is home to approximately 9 million residents, with 59.8% being White, 18.5% Asian, 13.3% Black, 5% Mixed, and 3.4% identifying as Other. The median age in the city is 36.5 years. Istanbul is home to approximately 15.5 million people, predominantly of Turkish ethnicity, with various ethnic minorities also present. The median age is 32 years."
  ]
}