{
  "x": [
    "\"Cairo - New York\"",
    "\"Sao Paulo + Johannesburg\"",
    "\"Rome + Beijing\"",
    "\"Sao Paulo - London\"",
    "\"Rome + Mumbai\"",
    "\"New York + Buenos Aires\"",
    "\"Los Angeles + Bangkok\"",
    "\"Paris - Paris\"",
    "\"Sydney + Lagos\"",
    "\"Beijing + Johannesburg\"",
    "\"Toronto + Sao Paulo\"",
    "\"Tokyo + Cairo\"",
    "\"London - Sydney\"",
    "\"Cairo - Los Angeles\"",
    "\"Toronto - Sydney\"",
    "\"Mexico City + Rome\"",
    "\"Bangkok - Rome\"",
    "\"Sao Paulo + Paris\"",
    "\"Istanbul + Bangkok\"",
    "\"Bangkok + Mexico City\""
  ],
  "y": [
    "105",
    "-19",
    "128",
    "-47",
    "85",
    "-132",
    "-18",
    "0",
    "154",
    "144",
    "-126",
    "171",
    "-151",
    "149",
    "-230",
    "-87",
    "88",
    "-45",
    "129",
    "1"
  ],
  "z": [
    "Using the longitudes of cities, the equation \"Cairo - New York\" translates as \"Cairo\" = 31, \"New York\" = -74. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sao Paulo + Johannesburg\" translates as \"Sao Paulo\" = -47, \"Johannesburg\" = 28. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Rome + Beijing\" translates as \"Rome\" = 12, \"Beijing\" = 116. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sao Paulo - London\" translates as \"Sao Paulo\" = -47, \"London\" = 0. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Rome + Mumbai\" translates as \"Rome\" = 12, \"Mumbai\" = 73. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"New York + Buenos Aires\" translates as \"New York\" = -74, \"Buenos Aires\" = -58. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Los Angeles + Bangkok\" translates as \"Los Angeles\" = -118, \"Bangkok\" = 100. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Paris - Paris\" translates as \"Paris\" = 2, \"Paris\" = 2. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sydney + Lagos\" translates as \"Sydney\" = 151, \"Lagos\" = 3. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Beijing + Johannesburg\" translates as \"Beijing\" = 116, \"Johannesburg\" = 28. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Toronto + Sao Paulo\" translates as \"Toronto\" = -79, \"Sao Paulo\" = -47. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Tokyo + Cairo\" translates as \"Tokyo\" = 140, \"Cairo\" = 31. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"London - Sydney\" translates as \"London\" = 0, \"Sydney\" = 151. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Cairo - Los Angeles\" translates as \"Cairo\" = 31, \"Los Angeles\" = -118. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Toronto - Sydney\" translates as \"Toronto\" = -79, \"Sydney\" = 151. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Mexico City + Rome\" translates as \"Mexico City\" = -99, \"Rome\" = 12. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Bangkok - Rome\" translates as \"Bangkok\" = 100, \"Rome\" = 12. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sao Paulo + Paris\" translates as \"Sao Paulo\" = -47, \"Paris\" = 2. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Istanbul + Bangkok\" translates as \"Istanbul\" = 29, \"Bangkok\" = 100. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Bangkok + Mexico City\" translates as \"Bangkok\" = 100, \"Mexico City\" = -99. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result."
  ],
  "z_uninformative": [
    "Cairo is the capital of Egypt. It's located near the Nile Delta and is known for its ancient Egyptian history. New York, often called New York City, is the most populous city in the United States. It's known for the Statue of Liberty.",
    "Sao Paulo is a sprawling city in Brazil. It's a major financial center and is known for its cultural institutions. Johannesburg, often known as Jo'burg, is the largest city in South Africa. It's the economic heart of Africa and is known for its modern architecture.",
    "Rome is the capital of Italy. It has a rich history and is home to the Colosseum. Beijing is the capital of China. It's known for its ancient sites including the Forbidden City.",
    "Sao Paulo is a sprawling city in Brazil. It's a major financial center and is known for its cultural institutions. London is the capital of England and the United Kingdom. It's renowned for its history, from its Roman beginnings to its cosmopolitan present.",
    "Rome is the capital of Italy. It has a rich history and is home to the Colosseum. Mumbai, formerly known as Bombay, is the financial capital of India. It's located on the west coast.",
    "New York, often called New York City, is the most populous city in the United States. It's known for the Statue of Liberty. Buenos Aires is the capital of Argentina. It is located in the southern hemisphere.",
    "Los Angeles is located in California, USA. It's famous for Hollywood and its entertainment industry. Bangkok is the capital of Thailand. It's known for its ornate temples, bustling street markets, and the grand palace.",
    "Paris is the capital of France. It's often referred to as 'The City of Love'. Paris is the capital of France. It's often referred to as 'The City of Love'.",
    "Sydney is the largest city in Australia. It's famous for its Harbour Bridge and the Sydney Opera House. Lagos is the largest city in Nigeria. It's a major financial center in Africa and is home to one of the largest and busiest ports on the continent.",
    "Beijing is the capital of China. It's known for its ancient sites including the Forbidden City. Johannesburg, often known as Jo'burg, is the largest city in South Africa. It's the economic heart of Africa and is known for its modern architecture.",
    "Toronto is the largest city in Canada. It's known for its modern skyline and the iconic CN Tower. Sao Paulo is a sprawling city in Brazil. It's a major financial center and is known for its cultural institutions.",
    "Tokyo is the capital of Japan. It's a bustling metropolis known for its modern architecture. Cairo is the capital of Egypt. It's located near the Nile Delta and is known for its ancient Egyptian history.",
    "London is the capital of England and the United Kingdom. It's renowned for its history, from its Roman beginnings to its cosmopolitan present. Sydney is the largest city in Australia. It's famous for its Harbour Bridge and the Sydney Opera House.",
    "Cairo is the capital of Egypt. It's located near the Nile Delta and is known for its ancient Egyptian history. Los Angeles is located in California, USA. It's famous for Hollywood and its entertainment industry.",
    "Toronto is the largest city in Canada. It's known for its modern skyline and the iconic CN Tower. Sydney is the largest city in Australia. It's famous for its Harbour Bridge and the Sydney Opera House.",
    "Mexico City is the capital of Mexico. It's known for its Templo Mayor, a 13th-century Aztec temple, and the Palacio Nacional, which houses historic murals. Rome is the capital of Italy. It has a rich history and is home to the Colosseum.",
    "Bangkok is the capital of Thailand. It's known for its ornate temples, bustling street markets, and the grand palace. Rome is the capital of Italy. It has a rich history and is home to the Colosseum.",
    "Sao Paulo is a sprawling city in Brazil. It's a major financial center and is known for its cultural institutions. Paris is the capital of France. It's often referred to as 'The City of Love'.",
    "Istanbul is a major city in Turkey. It's known for its rich history and the Hagia Sophia. Bangkok is the capital of Thailand. It's known for its ornate temples, bustling street markets, and the grand palace.",
    "Bangkok is the capital of Thailand. It's known for its ornate temples, bustling street markets, and the grand palace. Mexico City is the capital of Mexico. It's known for its Templo Mayor, a 13th-century Aztec temple, and the Palacio Nacional, which houses historic murals."
  ]
}