{
  "x": [
    "\"Mexico City - Lagos\"",
    "\"Moscow + Seoul\"",
    "\"Sao Paulo - Cairo\"",
    "\"Sao Paulo + New York\"",
    "\"Cairo + Seoul\"",
    "\"Paris - Beijing\"",
    "\"Toronto - Mexico City\"",
    "\"Sydney - Rome\"",
    "\"Mumbai - Sydney\"",
    "\"Bangkok - Mexico City\"",
    "\"New York + Buenos Aires\"",
    "\"Rome + Cairo\"",
    "\"New York + Sydney\"",
    "\"Moscow + Mexico City\"",
    "\"Sydney + Sydney\"",
    "\"Rome + Tokyo\"",
    "\"New York - New York\"",
    "\"Lagos + Istanbul\"",
    "\"Mumbai + Johannesburg\"",
    "\"Cairo - Lagos\""
  ],
  "y": [
    "-102",
    "165",
    "-78",
    "-121",
    "158",
    "-114",
    "20",
    "139",
    "-78",
    "199",
    "-132",
    "43",
    "77",
    "-61",
    "302",
    "152",
    "0",
    "32",
    "101",
    "28"
  ],
  "z": [
    "Using the longitudes of cities, the equation \"Mexico City - Lagos\" translates as \"Mexico City\" = -99, \"Lagos\" = 3. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Moscow + Seoul\" translates as \"Moscow\" = 38, \"Seoul\" = 127. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sao Paulo - Cairo\" translates as \"Sao Paulo\" = -47, \"Cairo\" = 31. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sao Paulo + New York\" translates as \"Sao Paulo\" = -47, \"New York\" = -74. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Cairo + Seoul\" translates as \"Cairo\" = 31, \"Seoul\" = 127. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Paris - Beijing\" translates as \"Paris\" = 2, \"Beijing\" = 116. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Toronto - Mexico City\" translates as \"Toronto\" = -79, \"Mexico City\" = -99. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sydney - Rome\" translates as \"Sydney\" = 151, \"Rome\" = 12. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Mumbai - Sydney\" translates as \"Mumbai\" = 73, \"Sydney\" = 151. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Bangkok - Mexico City\" translates as \"Bangkok\" = 100, \"Mexico City\" = -99. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"New York + Buenos Aires\" translates as \"New York\" = -74, \"Buenos Aires\" = -58. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Rome + Cairo\" translates as \"Rome\" = 12, \"Cairo\" = 31. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"New York + Sydney\" translates as \"New York\" = -74, \"Sydney\" = 151. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Moscow + Mexico City\" translates as \"Moscow\" = 38, \"Mexico City\" = -99. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Sydney + Sydney\" translates as \"Sydney\" = 151, \"Sydney\" = 151. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Rome + Tokyo\" translates as \"Rome\" = 12, \"Tokyo\" = 140. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"New York - New York\" translates as \"New York\" = -74, \"New York\" = -74. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Lagos + Istanbul\" translates as \"Lagos\" = 3, \"Istanbul\" = 29. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Mumbai + Johannesburg\" translates as \"Mumbai\" = 73, \"Johannesburg\" = 28. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result.",
    "Using the longitudes of cities, the equation \"Cairo - Lagos\" translates as \"Cairo\" = 31, \"Lagos\" = 3. Here the longitudes of the western hemisphere are negative numbers. And we round the coordinates to the nearest integer. This gives the result."
  ],
  "z_uninformative": [
    "Mexico City is the capital of Mexico. It's known for its Templo Mayor, a 13th-century Aztec temple, and the Palacio Nacional, which houses historic murals. Lagos is the largest city in Nigeria. It's a major financial center in Africa and is home to one of the largest and busiest ports on the continent.",
    "Moscow is the capital of Russia. The Kremlin and Red Square are among its most well-known landmarks. Seoul is the capital and largest metropolis of South Korea. It's a vibrant city known for its modern skyscrapers and ancient palaces.",
    "Sao Paulo is a sprawling city in Brazil. It's a major financial center and is known for its cultural institutions. Cairo is the capital of Egypt. It's located near the Nile Delta and is known for its ancient Egyptian history.",
    "Sao Paulo is a sprawling city in Brazil. It's a major financial center and is known for its cultural institutions. New York, often called New York City, is the most populous city in the United States. It's known for the Statue of Liberty.",
    "Cairo is the capital of Egypt. It's located near the Nile Delta and is known for its ancient Egyptian history. Seoul is the capital and largest metropolis of South Korea. It's a vibrant city known for its modern skyscrapers and ancient palaces.",
    "Paris is the capital of France. It's often referred to as 'The City of Love'. Beijing is the capital of China. It's known for its ancient sites including the Forbidden City.",
    "Toronto is the largest city in Canada. It's known for its modern skyline and the iconic CN Tower. Mexico City is the capital of Mexico. It's known for its Templo Mayor, a 13th-century Aztec temple, and the Palacio Nacional, which houses historic murals.",
    "Sydney is the largest city in Australia. It's famous for its Harbour Bridge and the Sydney Opera House. Rome is the capital of Italy. It has a rich history and is home to the Colosseum.",
    "Mumbai, formerly known as Bombay, is the financial capital of India. It's located on the west coast. Sydney is the largest city in Australia. It's famous for its Harbour Bridge and the Sydney Opera House.",
    "Bangkok is the capital of Thailand. It's known for its ornate temples, bustling street markets, and the grand palace. Mexico City is the capital of Mexico. It's known for its Templo Mayor, a 13th-century Aztec temple, and the Palacio Nacional, which houses historic murals.",
    "New York, often called New York City, is the most populous city in the United States. It's known for the Statue of Liberty. Buenos Aires is the capital of Argentina. It is located in the southern hemisphere.",
    "Rome is the capital of Italy. It has a rich history and is home to the Colosseum. Cairo is the capital of Egypt. It's located near the Nile Delta and is known for its ancient Egyptian history.",
    "New York, often called New York City, is the most populous city in the United States. It's known for the Statue of Liberty. Sydney is the largest city in Australia. It's famous for its Harbour Bridge and the Sydney Opera House.",
    "Moscow is the capital of Russia. The Kremlin and Red Square are among its most well-known landmarks. Mexico City is the capital of Mexico. It's known for its Templo Mayor, a 13th-century Aztec temple, and the Palacio Nacional, which houses historic murals.",
    "Sydney is the largest city in Australia. It's famous for its Harbour Bridge and the Sydney Opera House. Sydney is the largest city in Australia. It's famous for its Harbour Bridge and the Sydney Opera House.",
    "Rome is the capital of Italy. It has a rich history and is home to the Colosseum. Tokyo is the capital of Japan. It's a bustling metropolis known for its modern architecture.",
    "New York, often called New York City, is the most populous city in the United States. It's known for the Statue of Liberty. New York, often called New York City, is the most populous city in the United States. It's known for the Statue of Liberty.",
    "Lagos is the largest city in Nigeria. It's a major financial center in Africa and is home to one of the largest and busiest ports on the continent. Istanbul is a major city in Turkey. It's known for its rich history and the Hagia Sophia.",
    "Mumbai, formerly known as Bombay, is the financial capital of India. It's located on the west coast. Johannesburg, often known as Jo'burg, is the largest city in South Africa. It's the economic heart of Africa and is known for its modern architecture.",
    "Cairo is the capital of Egypt. It's located near the Nile Delta and is known for its ancient Egyptian history. Lagos is the largest city in Nigeria. It's a major financial center in Africa and is home to one of the largest and busiest ports on the continent."
  ]
}